/* automatically generated by rust-bindgen 0.69.2 */

pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 35;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __LDOUBLE_REDIRECTS_TO_FLOAT128_ABI: u32 = 0;

pub const VSL_SS_ED_MI_PARAMS_N: u32 = 50;
pub const VSL_SS_ED_MI_PARAMS: u32 = 51;
pub const VSL_SS_ED_MI_INIT_ESTIMATES_N: u32 = 52;
pub const VSL_SS_ED_MI_INIT_ESTIMATES: u32 = 53;
pub const VSL_SS_ED_MI_SIMUL_VALS_N: u32 = 54;
pub const VSL_SS_ED_MI_SIMUL_VALS: u32 = 55;
pub const VSL_SS_ED_MI_ESTIMATES_N: u32 = 56;
pub const VSL_SS_ED_MI_ESTIMATES: u32 = 57;
pub const VSL_SS_ED_MI_PRIOR_N: u32 = 58;
pub const VSL_SS_ED_MI_PRIOR: u32 = 59;
pub const VSL_SS_ED_PARAMTR_COR: u32 = 60;
pub const VSL_SS_ED_PARAMTR_COR_STORAGE: u32 = 61;
pub const VSL_SS_ED_STREAM_QUANT_PARAMS_N: u32 = 62;
pub const VSL_SS_ED_STREAM_QUANT_PARAMS: u32 = 63;
pub const VSL_SS_ED_STREAM_QUANT_ORDER_N: u32 = 64;
pub const VSL_SS_ED_STREAM_QUANT_ORDER: u32 = 65;
pub const VSL_SS_ED_STREAM_QUANT_QUANTILES: u32 = 66;
pub const VSL_SS_ED_MDAD: u32 = 76;
pub const VSL_SS_ED_MNAD: u32 = 77;
pub const VSL_SS_ED_SORTED_OBSERV: u32 = 78;
pub const VSL_SS_ED_SORTED_OBSERV_STORAGE: u32 = 79;
pub const VSL_SS_MEAN: u32 = 1;
pub const VSL_SS_2R_MOM: u32 = 2;
pub const VSL_SS_3R_MOM: u32 = 4;
pub const VSL_SS_4R_MOM: u32 = 8;
pub const VSL_SS_2C_MOM: u32 = 16;
pub const VSL_SS_3C_MOM: u32 = 32;
pub const VSL_SS_4C_MOM: u32 = 64;
pub const VSL_SS_SUM: u32 = 33554432;
pub const VSL_SS_2R_SUM: u32 = 67108864;
pub const VSL_SS_3R_SUM: u32 = 134217728;
pub const VSL_SS_4R_SUM: u32 = 268435456;
pub const VSL_SS_2C_SUM: u32 = 536870912;
pub const VSL_SS_3C_SUM: u32 = 1073741824;
pub const VSL_SS_4C_SUM: u32 = 2147483648;
pub const VSL_SS_KURTOSIS: u32 = 128;
pub const VSL_SS_SKEWNESS: u32 = 256;
pub const VSL_SS_VARIATION: u32 = 512;
pub const VSL_SS_MIN: u32 = 1024;
pub const VSL_SS_MAX: u32 = 2048;
pub const VSL_SS_COV: u32 = 4096;
pub const VSL_SS_COR: u32 = 8192;
pub const VSL_SS_CP: u64 = 4294967296;
pub const VSL_SS_POOLED_COV: u32 = 16384;
pub const VSL_SS_GROUP_COV: u32 = 32768;
pub const VSL_SS_POOLED_MEAN: u64 = 34359738368;
pub const VSL_SS_GROUP_MEAN: u64 = 68719476736;
pub const VSL_SS_QUANTS: u32 = 65536;
pub const VSL_SS_ORDER_STATS: u32 = 131072;
pub const VSL_SS_SORTED_OBSERV: u64 = 549755813888;
pub const VSL_SS_ROBUST_COV: u32 = 262144;
pub const VSL_SS_OUTLIERS: u32 = 524288;
pub const VSL_SS_PARTIAL_COV: u32 = 1048576;
pub const VSL_SS_PARTIAL_COR: u32 = 2097152;
pub const VSL_SS_MISSING_VALS: u32 = 4194304;
pub const VSL_SS_PARAMTR_COR: u32 = 8388608;
pub const VSL_SS_STREAM_QUANTS: u32 = 16777216;
pub const VSL_SS_MDAD: u64 = 8589934592;
pub const VSL_SS_MNAD: u64 = 17179869184;
pub type wchar_t = ::std::os::raw::c_int;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    const UNINIT: ::std::mem::MaybeUninit<div_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<ldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_slist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_rwlock_arch_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    const UNINIT: ::std::mem::MaybeUninit<__once_flag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    const UNINIT: ::std::mem::MaybeUninit<random_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    const UNINIT: ::std::mem::MaybeUninit<drand48_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__old_x) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__c) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__init) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__a) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MKL_Complex8 {
    pub real: f32,
    pub imag: f32,
}
#[test]
fn bindgen_test_layout__MKL_Complex8() {
    const UNINIT: ::std::mem::MaybeUninit<_MKL_Complex8> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_MKL_Complex8>(),
        8usize,
        concat!("Size of: ", stringify!(_MKL_Complex8))
    );
    assert_eq!(
        ::std::mem::align_of::<_MKL_Complex8>(),
        4usize,
        concat!("Alignment of ", stringify!(_MKL_Complex8))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).real) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_MKL_Complex8),
            "::",
            stringify!(real)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imag) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_MKL_Complex8),
            "::",
            stringify!(imag)
        )
    );
}
pub type MKL_Complex8 = _MKL_Complex8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MKL_Complex16 {
    pub real: f64,
    pub imag: f64,
}
#[test]
fn bindgen_test_layout__MKL_Complex16() {
    const UNINIT: ::std::mem::MaybeUninit<_MKL_Complex16> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_MKL_Complex16>(),
        16usize,
        concat!("Size of: ", stringify!(_MKL_Complex16))
    );
    assert_eq!(
        ::std::mem::align_of::<_MKL_Complex16>(),
        8usize,
        concat!("Alignment of ", stringify!(_MKL_Complex16))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).real) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_MKL_Complex16),
            "::",
            stringify!(real)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imag) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_MKL_Complex16),
            "::",
            stringify!(imag)
        )
    );
}
pub type MKL_Complex16 = _MKL_Complex16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MKLVersion {
    pub MajorVersion: ::std::os::raw::c_int,
    pub MinorVersion: ::std::os::raw::c_int,
    pub UpdateVersion: ::std::os::raw::c_int,
    pub ProductStatus: *mut ::std::os::raw::c_char,
    pub Build: *mut ::std::os::raw::c_char,
    pub Processor: *mut ::std::os::raw::c_char,
    pub Platform: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_MKLVersion() {
    const UNINIT: ::std::mem::MaybeUninit<MKLVersion> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MKLVersion>(),
        48usize,
        concat!("Size of: ", stringify!(MKLVersion))
    );
    assert_eq!(
        ::std::mem::align_of::<MKLVersion>(),
        8usize,
        concat!("Alignment of ", stringify!(MKLVersion))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MajorVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(MajorVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinorVersion) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(MinorVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UpdateVersion) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(UpdateVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductStatus) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(ProductStatus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Build) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(Build)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Processor) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(Processor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Platform) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(Platform)
        )
    );
}
pub const MKL_LAYOUT_MKL_ROW_MAJOR: MKL_LAYOUT = 101;
pub const MKL_LAYOUT_MKL_COL_MAJOR: MKL_LAYOUT = 102;
pub type MKL_LAYOUT = ::std::os::raw::c_uint;
pub const MKL_TRANSPOSE_MKL_NOTRANS: MKL_TRANSPOSE = 111;
pub const MKL_TRANSPOSE_MKL_TRANS: MKL_TRANSPOSE = 112;
pub const MKL_TRANSPOSE_MKL_CONJTRANS: MKL_TRANSPOSE = 113;
pub const MKL_TRANSPOSE_MKL_CONJ: MKL_TRANSPOSE = 114;
pub type MKL_TRANSPOSE = ::std::os::raw::c_uint;
pub const MKL_UPLO_MKL_UPPER: MKL_UPLO = 121;
pub const MKL_UPLO_MKL_LOWER: MKL_UPLO = 122;
pub type MKL_UPLO = ::std::os::raw::c_uint;
pub const MKL_DIAG_MKL_NONUNIT: MKL_DIAG = 131;
pub const MKL_DIAG_MKL_UNIT: MKL_DIAG = 132;
pub type MKL_DIAG = ::std::os::raw::c_uint;
pub const MKL_SIDE_MKL_LEFT: MKL_SIDE = 141;
pub const MKL_SIDE_MKL_RIGHT: MKL_SIDE = 142;
pub type MKL_SIDE = ::std::os::raw::c_uint;
pub const MKL_COMPACT_PACK_MKL_COMPACT_SSE: MKL_COMPACT_PACK = 181;
pub const MKL_COMPACT_PACK_MKL_COMPACT_AVX: MKL_COMPACT_PACK = 182;
pub const MKL_COMPACT_PACK_MKL_COMPACT_AVX512: MKL_COMPACT_PACK = 183;
pub type MKL_COMPACT_PACK = ::std::os::raw::c_uint;
pub type sgemm_jit_kernel_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut f32,
        arg3: *mut f32,
        arg4: *mut f32,
    ),
>;
pub type dgemm_jit_kernel_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut f64,
        arg3: *mut f64,
        arg4: *mut f64,
    ),
>;
pub type cgemm_jit_kernel_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut MKL_Complex8,
        arg3: *mut MKL_Complex8,
        arg4: *mut MKL_Complex8,
    ),
>;
pub type zgemm_jit_kernel_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut MKL_Complex16,
        arg3: *mut MKL_Complex16,
        arg4: *mut MKL_Complex16,
    ),
>;
pub const mkl_jit_status_t_MKL_JIT_SUCCESS: mkl_jit_status_t = 0;
pub const mkl_jit_status_t_MKL_NO_JIT: mkl_jit_status_t = 1;
pub const mkl_jit_status_t_MKL_JIT_ERROR: mkl_jit_status_t = 2;
pub type mkl_jit_status_t = ::std::os::raw::c_uint;
extern "C" {
    pub fn MKL_Get_Version(ver: *mut MKLVersion);
}
extern "C" {
    pub fn MKL_Get_Version_String(buffer: *mut ::std::os::raw::c_char, len: ::std::os::raw::c_int);
}
extern "C" {
    pub fn MKL_Free_Buffers();
}
extern "C" {
    pub fn MKL_Thread_Free_Buffers();
}
extern "C" {
    pub fn MKL_Mem_Stat(nbuffers: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn MKL_Peak_Mem_Usage(reset: ::std::os::raw::c_int) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn MKL_malloc(size: usize, align: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn MKL_calloc(
        num: usize,
        size: usize,
        align: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn MKL_realloc(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn MKL_free(ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn MKL_Disable_Fast_MM() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Get_Cpu_Clocks(arg1: *mut ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn MKL_Get_Cpu_Frequency() -> f64;
}
extern "C" {
    pub fn MKL_Get_Max_Cpu_Frequency() -> f64;
}
extern "C" {
    pub fn MKL_Get_Clocks_Frequency() -> f64;
}
extern "C" {
    pub fn MKL_Set_Num_Threads_Local(nth: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Set_Num_Threads(nth: ::std::os::raw::c_int);
}
extern "C" {
    pub fn MKL_Get_Max_Threads() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Set_Num_Stripes(nstripes: ::std::os::raw::c_int);
}
extern "C" {
    pub fn MKL_Get_Num_Stripes() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Domain_Set_Num_Threads(
        nth: ::std::os::raw::c_int,
        MKL_DOMAIN: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Domain_Get_Max_Threads(MKL_DOMAIN: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Set_Dynamic(bool_MKL_DYNAMIC: ::std::os::raw::c_int);
}
extern "C" {
    pub fn MKL_Get_Dynamic() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_PROGRESS(
        thread: *mut ::std::os::raw::c_int,
        step: *mut ::std::os::raw::c_int,
        stage: *mut ::std::os::raw::c_char,
        lstage: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_PROGRESS_(
        thread: *mut ::std::os::raw::c_int,
        step: *mut ::std::os::raw::c_int,
        stage: *mut ::std::os::raw::c_char,
        lstage: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkl_progress(
        thread: *mut ::std::os::raw::c_int,
        step: *mut ::std::os::raw::c_int,
        stage: *mut ::std::os::raw::c_char,
        lstage: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkl_progress_(
        thread: *mut ::std::os::raw::c_int,
        step: *mut ::std::os::raw::c_int,
        stage: *mut ::std::os::raw::c_char,
        lstage: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Enable_Instructions(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Set_Interface_Layer(code: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Set_Threading_Layer(code: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type XerblaEntry = ::std::option::Option<
    unsafe extern "C" fn(
        Name: *const ::std::os::raw::c_char,
        Num: *const ::std::os::raw::c_int,
        Len: ::std::os::raw::c_int,
    ),
>;
extern "C" {
    pub fn mkl_set_xerbla(xerbla: XerblaEntry) -> XerblaEntry;
}
pub type ProgressEntry = ::std::option::Option<
    unsafe extern "C" fn(
        thread: *mut ::std::os::raw::c_int,
        step: *mut ::std::os::raw::c_int,
        stage: *mut ::std::os::raw::c_char,
        stage_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn mkl_set_progress(progress: ProgressEntry) -> ProgressEntry;
}
pub type PardisopivotEntry = ::std::option::Option<
    unsafe extern "C" fn(aii: *mut f64, bii: *mut f64, eps: *mut f64) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn mkl_set_pardiso_pivot(pardiso_pivot: PardisopivotEntry) -> PardisopivotEntry;
}
extern "C" {
    pub fn MKL_CBWR_Get(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_CBWR_Set(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_CBWR_Get_Auto_Branch() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Set_Env_Mode(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Verbose(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Verbose_Output_File(fname: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
pub type MKLExitHandler = ::std::option::Option<unsafe extern "C" fn(why: ::std::os::raw::c_int)>;
extern "C" {
    pub fn MKL_Set_Exit_Handler(h: MKLExitHandler);
}
pub const MKL_BLACS_CUSTOM: _bindgen_ty_1 = 0;
pub const MKL_BLACS_MSMPI: _bindgen_ty_1 = 1;
pub const MKL_BLACS_INTELMPI: _bindgen_ty_1 = 2;
pub const MKL_BLACS_MPICH2: _bindgen_ty_1 = 3;
pub const MKL_BLACS_LASTMPI: _bindgen_ty_1 = 4;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
extern "C" {
    pub fn MKL_Set_mpi(
        vendor: ::std::os::raw::c_int,
        custom_library_name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Set_Memory_Limit(
        mem_type: ::std::os::raw::c_int,
        limit: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn MKL_Finalize();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DefVmlErrorContext {
    pub iCode: ::std::os::raw::c_int,
    pub iIndex: ::std::os::raw::c_int,
    pub dbA1: f64,
    pub dbA2: f64,
    pub dbR1: f64,
    pub dbR2: f64,
    pub cFuncName: [::std::os::raw::c_char; 64usize],
    pub iFuncNameLen: ::std::os::raw::c_int,
    pub dbA1Im: f64,
    pub dbA2Im: f64,
    pub dbR1Im: f64,
    pub dbR2Im: f64,
}
#[test]
fn bindgen_test_layout__DefVmlErrorContext() {
    const UNINIT: ::std::mem::MaybeUninit<_DefVmlErrorContext> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_DefVmlErrorContext>(),
        144usize,
        concat!("Size of: ", stringify!(_DefVmlErrorContext))
    );
    assert_eq!(
        ::std::mem::align_of::<_DefVmlErrorContext>(),
        8usize,
        concat!("Alignment of ", stringify!(_DefVmlErrorContext))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iCode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(iCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iIndex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(iIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbA1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(dbA1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbA2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(dbA2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbR1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(dbR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbR2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(dbR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cFuncName) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(cFuncName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iFuncNameLen) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(iFuncNameLen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbA1Im) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(dbA1Im)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbA2Im) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(dbA2Im)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbR1Im) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(dbR1Im)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbR2Im) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_DefVmlErrorContext),
            "::",
            stringify!(dbR2Im)
        )
    );
}
pub type DefVmlErrorContext = _DefVmlErrorContext;
pub type VMLErrorCallBack = ::std::option::Option<
    unsafe extern "C" fn(pdefVmlErrorContext: *mut DefVmlErrorContext) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn VSABS_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDABS_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsabs_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdabs_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAbs(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAbs(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSABS_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDABS_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsabs_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdabs_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAbs(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAbs(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCABS_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn VZABS_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn vcabs_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn vzabs_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn vcAbs(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn vzAbs(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn VMCABS_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZABS_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcabs_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzabs_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAbs(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAbs(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCARG_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn VZARG_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn vcarg_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn vzarg_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn vcArg(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn vzArg(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn VMCARG_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZARG_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcarg_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzarg_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcArg(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzArg(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSADD_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDADD_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsadd_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdadd_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAdd(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAdd(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSADD_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDADD_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsadd_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdadd_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAdd(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAdd(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCADD_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZADD_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcadd_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzadd_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcAdd(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzAdd(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn VMCADD_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZADD_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcadd_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzadd_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAdd(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAdd(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSUB_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDSUB_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vssub_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdsub_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsSub(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSub(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSUB_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSUB_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssub_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsub_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSub(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSub(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCSUB_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZSUB_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcsub_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzsub_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcSub(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzSub(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn VMCSUB_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZSUB_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcsub_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzsub_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcSub(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzSub(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSINV_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDINV_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsinv_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdinv_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsInv(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdInv(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSINV_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDINV_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsinv_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdinv_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsInv(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdInv(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSQRT_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDSQRT_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vssqrt_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdsqrt_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsSqrt(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSqrt(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSQRT_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSQRT_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssqrt_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsqrt_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSqrt(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSqrt(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCSQRT_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZSQRT_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcsqrt_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzsqrt_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcSqrt(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzSqrt(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCSQRT_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZSQRT_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcsqrt_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzsqrt_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcSqrt(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzSqrt(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSINVSQRT_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDINVSQRT_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsinvsqrt_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdinvsqrt_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsInvSqrt(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdInvSqrt(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSINVSQRT_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDINVSQRT_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsinvsqrt_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdinvsqrt_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsInvSqrt(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdInvSqrt(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCBRT_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCBRT_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vscbrt_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdcbrt_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCbrt(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCbrt(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCBRT_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCBRT_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmscbrt_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdcbrt_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCbrt(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCbrt(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSINVCBRT_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDINVCBRT_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsinvcbrt_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdinvcbrt_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsInvCbrt(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdInvCbrt(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSINVCBRT_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDINVCBRT_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsinvcbrt_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdinvcbrt_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsInvCbrt(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdInvCbrt(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSQR_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDSQR_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vssqr_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdsqr_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsSqr(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSqr(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSQR_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSQR_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssqr_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsqr_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSqr(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSqr(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSEXP_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDEXP_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsexp_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdexp_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsExp(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdExp(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSEXP_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDEXP_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsexp_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdexp_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsExp(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdExp(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCEXP_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZEXP_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcexp_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzexp_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcExp(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzExp(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCEXP_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZEXP_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcexp_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzexp_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcExp(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzExp(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSEXP2_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDEXP2_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsexp2_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdexp2_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsExp2(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdExp2(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSEXP2_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDEXP2_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsexp2_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdexp2_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsExp2(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdExp2(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSEXP10_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDEXP10_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsexp10_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdexp10_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsExp10(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdExp10(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSEXP10_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDEXP10_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsexp10_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdexp10_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsExp10(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdExp10(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSEXPM1_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDEXPM1_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsexpm1_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdexpm1_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsExpm1(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdExpm1(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSEXPM1_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDEXPM1_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsexpm1_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdexpm1_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsExpm1(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdExpm1(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSLN_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDLN_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsln_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdln_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsLn(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdLn(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSLN_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDLN_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsln_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdln_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsLn(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdLn(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCLN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZLN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcln_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzln_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcLn(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzLn(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCLN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZLN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcln_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzln_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcLn(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzLn(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSLOG2_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDLOG2_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vslog2_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdlog2_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsLog2(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdLog2(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSLOG2_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDLOG2_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmslog2_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdlog2_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsLog2(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdLog2(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSLOG10_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDLOG10_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vslog10_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdlog10_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsLog10(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdLog10(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSLOG10_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDLOG10_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmslog10_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdlog10_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsLog10(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdLog10(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCLOG10_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZLOG10_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vclog10_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzlog10_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcLog10(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzLog10(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCLOG10_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZLOG10_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmclog10_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzlog10_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcLog10(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzLog10(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSLOG1P_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDLOG1P_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vslog1p_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdlog1p_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsLog1p(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdLog1p(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSLOG1P_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDLOG1P_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmslog1p_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdlog1p_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsLog1p(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdLog1p(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSLOGB_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDLOGB_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vslogb_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdlogb_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsLogb(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdLogb(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSLOGB_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDLOGB_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmslogb_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdlogb_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsLogb(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdLogb(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCOS_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCOS_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vscos_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdcos_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCos(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCos(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCOS_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCOS_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmscos_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdcos_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCos(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCos(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCCOS_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZCOS_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vccos_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzcos_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcCos(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzCos(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCCOS_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZCOS_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmccos_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzcos_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcCos(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzCos(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSIN_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDSIN_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vssin_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdsin_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsSin(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSin(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSIN_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSIN_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssin_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsin_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSin(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSin(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCSIN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZSIN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcsin_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzsin_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcSin(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzSin(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCSIN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZSIN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcsin_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzsin_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcSin(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzSin(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSTAN_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDTAN_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vstan_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdtan_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsTan(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdTan(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSTAN_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDTAN_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmstan_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdtan_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsTan(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdTan(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCTAN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZTAN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vctan_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vztan_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcTan(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzTan(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCTAN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZTAN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmctan_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmztan_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcTan(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzTan(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCOSPI_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCOSPI_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vscospi_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdcospi_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCospi(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCospi(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCOSPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCOSPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmscospi_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdcospi_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCospi(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCospi(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSINPI_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDSINPI_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vssinpi_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdsinpi_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsSinpi(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSinpi(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSINPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSINPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssinpi_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsinpi_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSinpi(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSinpi(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSTANPI_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDTANPI_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vstanpi_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdtanpi_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsTanpi(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdTanpi(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSTANPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDTANPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmstanpi_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdtanpi_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsTanpi(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdTanpi(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCOSD_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCOSD_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vscosd_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdcosd_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCosd(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCosd(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCOSD_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCOSD_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmscosd_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdcosd_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCosd(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCosd(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSIND_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDSIND_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vssind_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdsind_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsSind(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSind(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSIND_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSIND_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssind_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsind_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSind(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSind(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSTAND_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDTAND_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vstand_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdtand_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsTand(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdTand(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSTAND_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDTAND_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmstand_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdtand_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsTand(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdTand(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCOSH_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCOSH_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vscosh_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdcosh_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCosh(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCosh(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCOSH_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCOSH_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmscosh_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdcosh_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCosh(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCosh(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCCOSH_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZCOSH_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vccosh_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzcosh_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcCosh(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzCosh(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCCOSH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZCOSH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmccosh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzcosh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcCosh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzCosh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSINH_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDSINH_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vssinh_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdsinh_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsSinh(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSinh(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSINH_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSINH_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssinh_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsinh_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSinh(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSinh(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCSINH_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZSINH_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcsinh_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzsinh_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcSinh(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzSinh(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCSINH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZSINH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcsinh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzsinh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcSinh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzSinh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSTANH_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDTANH_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vstanh_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdtanh_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsTanh(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdTanh(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSTANH_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDTANH_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmstanh_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdtanh_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsTanh(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdTanh(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCTANH_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZTANH_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vctanh_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vztanh_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcTanh(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzTanh(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCTANH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZTANH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmctanh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmztanh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcTanh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzTanh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSACOS_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDACOS_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsacos_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdacos_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAcos(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAcos(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSACOS_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDACOS_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsacos_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdacos_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAcos(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAcos(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCACOS_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZACOS_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcacos_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzacos_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcAcos(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzAcos(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCACOS_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZACOS_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcacos_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzacos_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAcos(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAcos(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSASIN_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDASIN_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsasin_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdasin_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAsin(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAsin(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSASIN_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDASIN_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsasin_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdasin_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAsin(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAsin(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCASIN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZASIN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcasin_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzasin_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcAsin(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzAsin(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCASIN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZASIN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcasin_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzasin_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAsin(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAsin(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSATAN_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDATAN_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsatan_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdatan_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAtan(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAtan(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSATAN_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDATAN_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsatan_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdatan_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAtan(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAtan(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCATAN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZATAN_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcatan_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzatan_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcAtan(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzAtan(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCATAN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZATAN_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcatan_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzatan_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAtan(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAtan(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSACOSPI_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDACOSPI_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsacospi_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdacospi_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAcospi(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAcospi(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSACOSPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDACOSPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsacospi_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdacospi_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAcospi(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAcospi(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSASINPI_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDASINPI_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsasinpi_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdasinpi_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAsinpi(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAsinpi(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSASINPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDASINPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsasinpi_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdasinpi_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAsinpi(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAsinpi(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSATANPI_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDATANPI_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsatanpi_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdatanpi_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAtanpi(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAtanpi(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSATANPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDATANPI_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsatanpi_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdatanpi_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAtanpi(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAtanpi(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSACOSH_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDACOSH_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsacosh_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdacosh_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAcosh(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAcosh(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSACOSH_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDACOSH_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsacosh_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdacosh_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAcosh(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAcosh(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCACOSH_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZACOSH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcacosh_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzacosh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcAcosh(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzAcosh(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCACOSH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZACOSH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcacosh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzacosh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAcosh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAcosh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSASINH_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDASINH_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsasinh_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdasinh_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAsinh(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAsinh(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSASINH_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDASINH_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsasinh_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdasinh_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAsinh(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAsinh(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCASINH_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZASINH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcasinh_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzasinh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcAsinh(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzAsinh(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCASINH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZASINH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcasinh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzasinh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAsinh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAsinh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSATANH_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDATANH_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsatanh_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdatanh_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAtanh(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAtanh(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSATANH_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDATANH_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsatanh_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdatanh_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAtanh(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAtanh(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCATANH_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZATANH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcatanh_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzatanh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcAtanh(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzAtanh(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCATANH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZATANH_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcatanh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzatanh_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAtanh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAtanh(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSERF_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDERF_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vserf_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vderf_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsErf(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdErf(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSERF_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDERF_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmserf_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmderf_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsErf(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdErf(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSERFINV_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDERFINV_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vserfinv_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vderfinv_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsErfInv(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdErfInv(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSERFINV_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDERFINV_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmserfinv_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmderfinv_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsErfInv(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdErfInv(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSHYPOT_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDHYPOT_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vshypot_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdhypot_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsHypot(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdHypot(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSHYPOT_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDHYPOT_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmshypot_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdhypot_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsHypot(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdHypot(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSERFC_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDERFC_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vserfc_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vderfc_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsErfc(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdErfc(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSERFC_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDERFC_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmserfc_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmderfc_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsErfc(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdErfc(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSERFCINV_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDERFCINV_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vserfcinv_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vderfcinv_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsErfcInv(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdErfcInv(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSERFCINV_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDERFCINV_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmserfcinv_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmderfcinv_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsErfcInv(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdErfcInv(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCDFNORM_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCDFNORM_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vscdfnorm_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdcdfnorm_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCdfNorm(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCdfNorm(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCDFNORM_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCDFNORM_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmscdfnorm_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdcdfnorm_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCdfNorm(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCdfNorm(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCDFNORMINV_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCDFNORMINV_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vscdfnorminv_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdcdfnorminv_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCdfNormInv(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCdfNormInv(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCDFNORMINV_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCDFNORMINV_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmscdfnorminv_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdcdfnorminv_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCdfNormInv(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCdfNormInv(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSLGAMMA_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDLGAMMA_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vslgamma_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdlgamma_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsLGamma(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdLGamma(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSLGAMMA_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDLGAMMA_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmslgamma_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdlgamma_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsLGamma(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdLGamma(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSTGAMMA_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDTGAMMA_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vstgamma_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdtgamma_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsTGamma(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdTGamma(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSTGAMMA_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDTGAMMA_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmstgamma_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdtgamma_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsTGamma(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdTGamma(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSATAN2_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDATAN2_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsatan2_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdatan2_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAtan2(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAtan2(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSATAN2_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDATAN2_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsatan2_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdatan2_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAtan2(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAtan2(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSATAN2PI_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDATAN2PI_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsatan2pi_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdatan2pi_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAtan2pi(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAtan2pi(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSATAN2PI_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDATAN2PI_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsatan2pi_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdatan2pi_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAtan2pi(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAtan2pi(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSMUL_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDMUL_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsmul_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdmul_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsMul(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdMul(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSMUL_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDMUL_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsmul_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdmul_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsMul(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdMul(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCMUL_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZMUL_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcmul_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzmul_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcMul(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzMul(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn VMCMUL_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZMUL_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcmul_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzmul_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcMul(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzMul(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSDIV_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDDIV_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsdiv_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vddiv_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsDiv(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdDiv(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSDIV_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDDIV_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsdiv_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmddiv_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsDiv(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdDiv(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCDIV_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZDIV_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcdiv_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzdiv_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcDiv(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzDiv(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn VMCDIV_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZDIV_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcdiv_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzdiv_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcDiv(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzDiv(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSPOW_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDPOW_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vspow_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdpow_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsPow(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdPow(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSPOW_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDPOW_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmspow_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdpow_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsPow(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdPow(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCPOW_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZPOW_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcpow_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzpow_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcPow(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzPow(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn VMCPOW_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZPOW_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcpow_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzpow_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcPow(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzPow(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSPOW3O2_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDPOW3O2_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vspow3o2_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdpow3o2_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsPow3o2(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdPow3o2(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSPOW3O2_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDPOW3O2_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmspow3o2_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdpow3o2_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsPow3o2(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdPow3o2(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSPOW2O3_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDPOW2O3_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vspow2o3_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdpow2o3_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsPow2o3(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdPow2o3(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSPOW2O3_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDPOW2O3_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmspow2o3_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdpow2o3_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsPow2o3(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdPow2o3(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSPOWX_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDPOWX_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vspowx_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdpowx_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsPowx(n: ::std::os::raw::c_int, a: *const f32, b: f32, r: *mut f32);
}
extern "C" {
    pub fn vdPowx(n: ::std::os::raw::c_int, a: *const f64, b: f64, r: *mut f64);
}
extern "C" {
    pub fn VMSPOWX_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDPOWX_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmspowx_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdpowx_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsPowx(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdPowx(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCPOWX_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZPOWX_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcpowx_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzpowx_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcPowx(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzPowx(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn VMCPOWX_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZPOWX_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcpowx_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzpowx_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcPowx(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzPowx(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSPOWR_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDPOWR_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vspowr_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdpowr_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsPowr(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdPowr(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSPOWR_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDPOWR_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmspowr_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdpowr_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsPowr(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdPowr(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSINCOS_(n: *const ::std::os::raw::c_int, a: *const f32, r1: *mut f32, r2: *mut f32);
}
extern "C" {
    pub fn VDSINCOS_(n: *const ::std::os::raw::c_int, a: *const f64, r1: *mut f64, r2: *mut f64);
}
extern "C" {
    pub fn vssincos_(n: *const ::std::os::raw::c_int, a: *const f32, r1: *mut f32, r2: *mut f32);
}
extern "C" {
    pub fn vdsincos_(n: *const ::std::os::raw::c_int, a: *const f64, r1: *mut f64, r2: *mut f64);
}
extern "C" {
    pub fn vsSinCos(n: ::std::os::raw::c_int, a: *const f32, r1: *mut f32, r2: *mut f32);
}
extern "C" {
    pub fn vdSinCos(n: ::std::os::raw::c_int, a: *const f64, r1: *mut f64, r2: *mut f64);
}
extern "C" {
    pub fn VMSSINCOS_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r1: *mut f32,
        r2: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSINCOS_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r1: *mut f64,
        r2: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssincos_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r1: *mut f32,
        r2: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsincos_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r1: *mut f64,
        r2: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSinCos(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r1: *mut f32,
        r2: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSinCos(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r1: *mut f64,
        r2: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSLINEARFRAC_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        scalea: *const f32,
        shifta: *const f32,
        scaleb: *const f32,
        shiftb: *const f32,
        r: *mut f32,
    );
}
extern "C" {
    pub fn VDLINEARFRAC_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        scalea: *const f64,
        shifta: *const f64,
        scaleb: *const f64,
        shiftb: *const f64,
        r: *mut f64,
    );
}
extern "C" {
    pub fn vslinearfrac_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        scalea: *const f32,
        shifta: *const f32,
        scaleb: *const f32,
        shiftb: *const f32,
        r: *mut f32,
    );
}
extern "C" {
    pub fn vdlinearfrac_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        scalea: *const f64,
        shifta: *const f64,
        scaleb: *const f64,
        shiftb: *const f64,
        r: *mut f64,
    );
}
extern "C" {
    pub fn vsLinearFrac(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        scalea: f32,
        shifta: f32,
        scaleb: f32,
        shiftb: f32,
        r: *mut f32,
    );
}
extern "C" {
    pub fn vdLinearFrac(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        scalea: f64,
        shifta: f64,
        scaleb: f64,
        shiftb: f64,
        r: *mut f64,
    );
}
extern "C" {
    pub fn VMSLINEARFRAC_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        scalea: *const f32,
        shifta: *const f32,
        scaleb: *const f32,
        shiftb: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDLINEARFRAC_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        scalea: *const f64,
        shifta: *const f64,
        scaleb: *const f64,
        shiftb: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmslinearfrac_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        scalea: *const f32,
        shifta: *const f32,
        scaleb: *const f32,
        shiftb: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdlinearfrac_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        scalea: *const f64,
        shifta: *const f64,
        scaleb: *const f64,
        shiftb: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsLinearFrac(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        scalea: f32,
        shifta: f32,
        scaleb: f32,
        shiftb: f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdLinearFrac(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        scalea: f64,
        shifta: f64,
        scaleb: f64,
        shiftb: f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCEIL_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCEIL_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsceil_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdceil_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCeil(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCeil(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCEIL_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCEIL_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsceil_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdceil_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCeil(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCeil(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSFLOOR_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDFLOOR_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsfloor_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdfloor_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsFloor(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdFloor(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSFLOOR_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDFLOOR_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsfloor_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdfloor_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsFloor(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdFloor(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSFRAC_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDFRAC_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsfrac_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdfrac_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsFrac(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdFrac(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSFRAC_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDFRAC_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsfrac_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdfrac_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsFrac(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdFrac(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSMODF_(n: *const ::std::os::raw::c_int, a: *const f32, r1: *mut f32, r2: *mut f32);
}
extern "C" {
    pub fn VDMODF_(n: *const ::std::os::raw::c_int, a: *const f64, r1: *mut f64, r2: *mut f64);
}
extern "C" {
    pub fn vsmodf_(n: *const ::std::os::raw::c_int, a: *const f32, r1: *mut f32, r2: *mut f32);
}
extern "C" {
    pub fn vdmodf_(n: *const ::std::os::raw::c_int, a: *const f64, r1: *mut f64, r2: *mut f64);
}
extern "C" {
    pub fn vsModf(n: ::std::os::raw::c_int, a: *const f32, r1: *mut f32, r2: *mut f32);
}
extern "C" {
    pub fn vdModf(n: ::std::os::raw::c_int, a: *const f64, r1: *mut f64, r2: *mut f64);
}
extern "C" {
    pub fn VMSMODF_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r1: *mut f32,
        r2: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDMODF_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r1: *mut f64,
        r2: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsmodf_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r1: *mut f32,
        r2: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdmodf_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r1: *mut f64,
        r2: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsModf(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r1: *mut f32,
        r2: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdModf(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r1: *mut f64,
        r2: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSFMOD_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDFMOD_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsfmod_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdfmod_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsFmod(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdFmod(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSFMOD_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDFMOD_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsfmod_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdfmod_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsFmod(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdFmod(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSREMAINDER_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDREMAINDER_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsremainder_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdremainder_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsRemainder(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdRemainder(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSREMAINDER_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDREMAINDER_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsremainder_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdremainder_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsRemainder(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdRemainder(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSNEXTAFTER_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDNEXTAFTER_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsnextafter_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdnextafter_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsNextAfter(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdNextAfter(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSNEXTAFTER_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDNEXTAFTER_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsnextafter_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdnextafter_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsNextAfter(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdNextAfter(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCOPYSIGN_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCOPYSIGN_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vscopysign_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdcopysign_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCopySign(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCopySign(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCOPYSIGN_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCOPYSIGN_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmscopysign_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdcopysign_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCopySign(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCopySign(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSFDIM_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDFDIM_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsfdim_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdfdim_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsFdim(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdFdim(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSFDIM_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDFDIM_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsfdim_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdfdim_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsFdim(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdFdim(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSFMAX_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDFMAX_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsfmax_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdfmax_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsFmax(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdFmax(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSFMAX_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDFMAX_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsfmax_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdfmax_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsFmax(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdFmax(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSFMIN_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDFMIN_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsfmin_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdfmin_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsFmin(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdFmin(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSFMIN_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDFMIN_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsfmin_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdfmin_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsFmin(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdFmin(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSMAXMAG_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDMAXMAG_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsmaxmag_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdmaxmag_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsMaxMag(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdMaxMag(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSMAXMAG_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDMAXMAG_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsmaxmag_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdmaxmag_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsMaxMag(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdMaxMag(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSMINMAG_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDMINMAG_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsminmag_(n: *const ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdminmag_(n: *const ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsMinMag(n: ::std::os::raw::c_int, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdMinMag(n: ::std::os::raw::c_int, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSMINMAG_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDMINMAG_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsminmag_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdminmag_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsMinMag(
        n: ::std::os::raw::c_int,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdMinMag(
        n: ::std::os::raw::c_int,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSNEARBYINT_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDNEARBYINT_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsnearbyint_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdnearbyint_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsNearbyInt(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdNearbyInt(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSNEARBYINT_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDNEARBYINT_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsnearbyint_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdnearbyint_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsNearbyInt(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdNearbyInt(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSRINT_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDRINT_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsrint_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdrint_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsRint(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdRint(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSRINT_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDRINT_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsrint_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdrint_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsRint(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdRint(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSROUND_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDROUND_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsround_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdround_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsRound(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdRound(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSROUND_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDROUND_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsround_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdround_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsRound(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdRound(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSTRUNC_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDTRUNC_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vstrunc_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdtrunc_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsTrunc(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdTrunc(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSTRUNC_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDTRUNC_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmstrunc_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdtrunc_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsTrunc(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdTrunc(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCCONJ_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZCONJ_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcconj_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzconj_(n: *const ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcConj(n: ::std::os::raw::c_int, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzConj(n: ::std::os::raw::c_int, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCCONJ_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZCONJ_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcconj_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzconj_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcConj(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzConj(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCMULBYCONJ_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZMULBYCONJ_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcmulbyconj_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzmulbyconj_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcMulByConj(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzMulByConj(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn VMCMULBYCONJ_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZMULBYCONJ_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcmulbyconj_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzmulbyconj_(
        n: *const ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcMulByConj(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzMulByConj(
        n: ::std::os::raw::c_int,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCCIS_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn VZCIS_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vccis_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzcis_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn vcCIS(n: ::std::os::raw::c_int, a: *const f32, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzCIS(n: ::std::os::raw::c_int, a: *const f64, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCCIS_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZCIS_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmccis_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzcis_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcCIS(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzCIS(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSEXPINT1_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDEXPINT1_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsexpint1_(n: *const ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdexpint1_(n: *const ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsExpInt1(n: ::std::os::raw::c_int, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdExpInt1(n: ::std::os::raw::c_int, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSEXPINT1_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDEXPINT1_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsexpint1_(
        n: *const ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdexpint1_(
        n: *const ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsExpInt1(
        n: ::std::os::raw::c_int,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdExpInt1(
        n: ::std::os::raw::c_int,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSABS_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDABS_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsabs_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdabs_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsAbs_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAbs_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSABS_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDABS_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsabs_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdabs_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAbs_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAbs_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCABS_64_(n: *const ::std::os::raw::c_longlong, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn VZABS_64_(n: *const ::std::os::raw::c_longlong, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn vcabs_64_(n: *const ::std::os::raw::c_longlong, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn vzabs_64_(n: *const ::std::os::raw::c_longlong, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn vcAbs_64(n: ::std::os::raw::c_longlong, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn vzAbs_64(n: ::std::os::raw::c_longlong, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn VMCABS_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZABS_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcabs_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzabs_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAbs_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAbs_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCARG_64_(n: *const ::std::os::raw::c_longlong, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn VZARG_64_(n: *const ::std::os::raw::c_longlong, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn vcarg_64_(n: *const ::std::os::raw::c_longlong, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn vzarg_64_(n: *const ::std::os::raw::c_longlong, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn vcArg_64(n: ::std::os::raw::c_longlong, a: *const MKL_Complex8, r: *mut f32);
}
extern "C" {
    pub fn vzArg_64(n: ::std::os::raw::c_longlong, a: *const MKL_Complex16, r: *mut f64);
}
extern "C" {
    pub fn VMCARG_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZARG_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcarg_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzarg_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcArg_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzArg_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSADD_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
    );
}
extern "C" {
    pub fn VDADD_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
    );
}
extern "C" {
    pub fn vsadd_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
    );
}
extern "C" {
    pub fn vdadd_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
    );
}
extern "C" {
    pub fn vsAdd_64(n: ::std::os::raw::c_longlong, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdAdd_64(n: ::std::os::raw::c_longlong, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSADD_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDADD_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsadd_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdadd_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsAdd_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdAdd_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCADD_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZADD_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcadd_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzadd_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcAdd_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzAdd_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn VMCADD_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZADD_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcadd_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzadd_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcAdd_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzAdd_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSUB_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
    );
}
extern "C" {
    pub fn VDSUB_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
    );
}
extern "C" {
    pub fn vssub_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
    );
}
extern "C" {
    pub fn vdsub_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
    );
}
extern "C" {
    pub fn vsSub_64(n: ::std::os::raw::c_longlong, a: *const f32, b: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSub_64(n: ::std::os::raw::c_longlong, a: *const f64, b: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSUB_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSUB_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssub_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsub_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSub_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        b: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSub_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        b: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCSUB_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZSUB_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcsub_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzsub_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcSub_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzSub_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn VMCSUB_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZSUB_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcsub_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzsub_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcSub_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        b: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzSub_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        b: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSINV_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDINV_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsinv_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdinv_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsInv_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdInv_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSINV_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDINV_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsinv_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdinv_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsInv_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdInv_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSQRT_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDSQRT_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vssqrt_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdsqrt_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsSqrt_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSqrt_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSQRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSQRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssqrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsqrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSqrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSqrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCSQRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZSQRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcsqrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzsqrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcSqrt_64(n: ::std::os::raw::c_longlong, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzSqrt_64(n: ::std::os::raw::c_longlong, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCSQRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZSQRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcsqrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzsqrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcSqrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzSqrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSINVSQRT_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDINVSQRT_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsinvsqrt_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdinvsqrt_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsInvSqrt_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdInvSqrt_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSINVSQRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDINVSQRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsinvsqrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdinvsqrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsInvSqrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdInvSqrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSCBRT_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDCBRT_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vscbrt_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdcbrt_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsCbrt_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdCbrt_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSCBRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDCBRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmscbrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdcbrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsCbrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdCbrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSINVCBRT_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDINVCBRT_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsinvcbrt_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdinvcbrt_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsInvCbrt_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdInvCbrt_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSINVCBRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDINVCBRT_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsinvcbrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdinvcbrt_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsInvCbrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdInvCbrt_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSSQR_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDSQR_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vssqr_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdsqr_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsSqr_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdSqr_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSSQR_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDSQR_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmssqr_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdsqr_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsSqr_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdSqr_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSEXP_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDEXP_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsexp_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdexp_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsExp_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdExp_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSEXP_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDEXP_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsexp_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdexp_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsExp_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdExp_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCEXP_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZEXP_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcexp_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzexp_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcExp_64(n: ::std::os::raw::c_longlong, a: *const MKL_Complex8, r: *mut MKL_Complex8);
}
extern "C" {
    pub fn vzExp_64(n: ::std::os::raw::c_longlong, a: *const MKL_Complex16, r: *mut MKL_Complex16);
}
extern "C" {
    pub fn VMCEXP_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMZEXP_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcexp_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzexp_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmcExp_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmzExp_64(
        n: ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSEXP2_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDEXP2_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsexp2_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdexp2_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsExp2_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdExp2_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSEXP2_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDEXP2_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsexp2_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdexp2_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsExp2_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdExp2_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSEXP10_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDEXP10_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsexp10_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdexp10_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsExp10_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdExp10_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSEXP10_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDEXP10_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsexp10_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdexp10_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsExp10_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdExp10_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSEXPM1_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDEXPM1_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsexpm1_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdexpm1_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsExpm1_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdExpm1_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSEXPM1_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDEXPM1_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsexpm1_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdexpm1_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsExpm1_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdExpm1_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VSLN_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn VDLN_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsln_64_(n: *const ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdln_64_(n: *const ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn vsLn_64(n: ::std::os::raw::c_longlong, a: *const f32, r: *mut f32);
}
extern "C" {
    pub fn vdLn_64(n: ::std::os::raw::c_longlong, a: *const f64, r: *mut f64);
}
extern "C" {
    pub fn VMSLN_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VMDLN_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsln_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdln_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: *mut ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmsLn_64(
        n: ::std::os::raw::c_longlong,
        a: *const f32,
        r: *mut f32,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn vmdLn_64(
        n: ::std::os::raw::c_longlong,
        a: *const f64,
        r: *mut f64,
        mode: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn VCLN_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn VZLN_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex16,
        r: *mut MKL_Complex16,
    );
}
extern "C" {
    pub fn vcln_64_(
        n: *const ::std::os::raw::c_longlong,
        a: *const MKL_Complex8,
        r: *mut MKL_Complex8,
    );
}
extern "C" {
    pub fn vzln_64_(
        n: *const ::std::os::raw::c_longlong,
